<?php
require PREFIX.'/Define/stdafx.php';
/**
* BL_Template
*
* @package 
* @author
* @copyright
* @version CVS:
*/
class BL_Template extends BL_Base
{

/**
* BissinesLogic 参照・基底クラス
* @package
* @author
* @copyright
* @version
*/
function __construct($ActionName){
    //--------------------------------------------------------------------------
    // スーパークラスのコンストラクタ
    //--------------------------------------------------------------------------
    parent::__construct($ActionName);
}

/**
* BissinesLogic メイン実行クラス
*
* @package 
* @author
* @copyright
* @version
*/
function execute($input){
    //--------------------------------------------------------------------------
    // BLに引き継がれたリクエスト くどいのでここで出さない
    //--------------------------------------------------------------------------
    //$this->action_debug(__LINE__.':'.'BLに引き継がれたリクエスト=>',$input,$this->Action);

    //--------------------------------------------------------------------------
    // あらかじめ失敗文言を記載
    //--------------------------------------------------------------------------
    $this->Data['result']['code']=9;
    $this->Data['result']['obj']='異常終了';
    $this->Data['result']['mes']='更新作業を実施しようとして失敗しました。';

    //--------------------------------------------------------------------------
    // ハンドリングが終わっているので結果をJSONで返す
    //--------------------------------------------------------------------------
    $this->Data['result']['code']=0;
    $this->Data['result']['obj']='正常終了';
    $this->Data['result']['mes']='更新作業が正常に終了しました。';

    //--------------------------------------------------------------------------
    // ページタイトルを出力
    //--------------------------------------------------------------------------
    $this->Data['page_title']='ページタイトルを書く';

    //--------------------------------------------------------------------------
    // 出力するデータをreturnする
    //--------------------------------------------------------------------------
    return $this->Data;
}

/* デストラクタ */
function __destruct(){
    //--------------------------------------------------------------------------
    // スーパークラスのデストラクタ
    //--------------------------------------------------------------------------
    parent::__destruct();
}

}
