<?php
require PREFIX . '/Define/stdafx.php';
/**
 * コントローラー テンプレート
 *
 * @package        
 * @author         
 * @copyright      
 * @version :
 */
class TemplateController extends ActionBase
{
    
    /**
     * コンストラクタ
     *
     *
     * @package 
     * @author 
     * @copyright 
     * @version:
     */
    function __construct($cli = null)
    {
        //--------------------------------------------------------------------------
        // スーパークラスのコンストラクタ 第2引数はcli用
        //--------------------------------------------------------------------------
        parent::__construct(get_class($this), $cli);

        //--------------------------------------------------------------------------
        // ログインのチェック。ログイン状態でないと処理はしない。
        //--------------------------------------------------------------------------
        if($_SESSION["is_auth"]!=true || !isset($_SESSION["LOGIN"]) || (int)$_SESSION["LOGIN"]["id"] < 2){
            $Data['Action']=$this->ActionName;//アクション名
            $Data['uuid']=$_SESSION['UUID'];//UUID
            $Data["LOGIN"]=array(
                "id"=>null,
                "company_name "=>null,
                "tantou_name_sei"=>null,
                "tantou_name_mei"=>null,
                "mail_adress"=>null,
            );//JNT側のログイン情報
            $this->AjaxRader($Data);
            exit;
        }

        //--------------------------------------------------------------------------
        // 入力チェック 書き方は input_check.txtを参照
        //--------------------------------------------------------------------------
        $this->ChkParam = array(
            ### INPUT_CHECK ###
        );

        //--------------------------------------------------------------------------
        // 入力チェック。ここでハンドリングするので変数で管理
        //--------------------------------------------------------------------------
        $input=$this->MakearyAvtionChk($this->request);

        //--------------------------------------------------------------------------
        // resultにエラーやヴァリテーションバックがないかどうかチェック
        //--------------------------------------------------------------------------
        if($input["result"]=="PARAM_ERROR"){
            $this->action_debug('◆ パラメーターエラー', $input["result"]);
            $this->SmartyRader($this->ActionName, PARAM_ERROR);
            exit;
        }

        //--------------------------------------------------------------------------
        // Logicクラスをインスタンスする。コンストラクタにてアクション名を引継ぐ。
        //--------------------------------------------------------------------------
        $BL_Name       = 'BL_' . $this->ActionName;
        $BissinesLogic = new $BL_Name($this->ActionName);

        //--------------------------------------------------------------------------
        // INPUTはそろっているので、ここでどのイベントをおこすか決める
        // ※メソッド名は任意でよい。ただし、コンストラクタにはしない事!!!
        //--------------------------------------------------------------------------
        $Data = $BissinesLogic->execute($input);

        //--------------------------------------------------------------------------
        // 出力結果配列をログに表示
        //--------------------------------------------------------------------------
        if(php_sapi_name()!='cli') 
            $this->action_debug('$Data=>', $Data);

        //--------------------------------------------------------------------------
        //勿論JSON出力の場合もあるので、AcrionBase配下に作成する
        //--------------------------------------------------------------------------
        //$this->SmartyRader($this->ActionName, $Data);
        $this->AjaxRader($Data);
        exit;
    }

    function __destruct()
    {
        //--------------------------------------------------------------------------
        // スーパークラスのデクトラクタ
        //--------------------------------------------------------------------------
        parent::__destruct();
    }
}
